Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བའི་མདོ་སྡེའི་རྒྱལ་པོ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Sublime Golden Light, the Supremely Victorious King of Sūtras

source: བམ་པོ་དང་པོ།
en: Chapter 1: The Introduction

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to all the buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་སྤུངས་པའི་རི་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཆོས་ཀྱི་དབྱིངས་ཟབ་མོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་དེ་བཞིན་གཤེགས་པའི་གནས་ན་དགེ་སློང་ཆེན་པོའི་དགེ་འདུན་ཁྲི་ཕྲག་དགུ་ཁྲི་བརྒྱད་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཤ་སྟག །གླང་པོ་ཆེའི་རྒྱལ་པོ་ལྟར་ཤིན་ཏུ་རྣམ་པར་བྱང་བ་ཤ་སྟག །ཟག་པ་ཟད་པ་ཤ་སྟག །ཉོན་མོངས་པ་མེད་པ་ཤ་སྟག །སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ཤ་སྟག །ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ཤ་སྟག །བྱ་བ་བྱས་པ་ཤ་སྟག །ཁུར་བོར་བ་ཤ་སྟག །བདག་གི་དོན་རབ་ཏུ་རྙེད་པ་ཤ་སྟག །སྲིད་པའི་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ་ཤ་སྟག །དམ་པའི་དབང་མཆོག་ཐོབ་པ་ཤ་སྟག །ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ལ་གནས་པ་ཤ་སྟག །ཐབས་དང་ཤེས་རབ་ཏུ་ལྡན་པར་མཁས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་ཤ་སྟག །རྣམ་པར་ཐར་པ་བརྒྱད་དང་ལྡན་པ་ཤ་སྟག །ཕ་རོལ་དུ་ཡོངས་སུ་ཕྱིན་པ་ཤ་སྟག་སྟེ། དེ་དག་གི་མིང་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་། ཚེ་དང་ལྡན་པ་མིང་ཆེན་དང་། ཚེ་དང་ལྡན་པ་བཟང་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ག་ཡཱ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཆུ་བོ་འོད་སྲུང་དང་།
en: The Bhagavat was within the profound, completely pure realm of the Dharma that is the field of activity of all the buddhas, dwelling at Vulture Peak mountain at Rājagṛha together with a saṅgha of ten thousand times ninety-eight thousand great bhikṣus who were all without exception arhats, all of whom were purified like the king of elephants, all of whose defilements had ceased, all of whom were without kleśas, all of whom had liberated minds, all of whom had completely liberated wisdom, all of whom had done what had to be done, all of whom had put down their burden, all of whom had attained the goal, all of whom had ended engagement with existence, all of whom had attained supreme sublime power, all of whom maintained pure correct conduct, all of whom were adorned by skill in method and wisdom, all of whom possessed the eight liberations, and all of whom had reached the farther shore.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། དེ་ལ་གཅིག་མ་གཏོགས་པ་དེ་ནི་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟེ། དེ་ལ་སོགས་ཏེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཆེན་པོ་རྣམས་ཕྱི་དྲོའི་དུས་ན་སོ་སོའི་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་གང་ན་པ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས།
en: Their names were Venerable Ājñātakauṇḍinya, Venerable Aśvajit, Venerable Vāṣpa, Venerable Mahānāman, Venerable Bhadrika, Venerable Mahākāśyapa, Venerable Uruvilvakāśyapa, Venerable Gayākāśyapa, Venerable Nadīkāśyapa, Venerable Śāriputra, Venerable Mahāmaudgalyāyana, and so on, who were all, apart from Venerable Ānanda, a great saṅgha of śrāvakas, who had arisen from their afternoon samādhi and come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: གཡས་ཕྱོགས་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །གཞན་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྙེད་ཀྱང་དེ་ན་འདུས་པར་གྱུར་ཏེ། ཐམས་ཅད་ཀྱང་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ལྟར་གཟི་བརྗིད་ཀྱི་བྱིན་གྱི་མཐུ་ཆེ་བ། ཤིན་དུ་གྲགས་པ་དང་ལྡན་པ། ཅང་ཤེས་དང་ལྡན་པ། སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པ་དང་། ཡོངས་སུ་དག་པ། བསྐལ་པ་གྲངས་མེད་པ་ནས་བཟོད་པ་དང་། བརྩོན་འགྲུས་སུ་ལྡན་པ། བསམ་གཏན་ཐམས་ཅད་ལས་ཡོངས་སུ་འདས་པ། དྲན་པ་མངོན་པར་གཞག་པ། ཤེས་རབ་ཀྱི་སྒོ་ཡོངས་སུ་འབྱེད་པ། རྣལ་འབྱོར་དང་ཐབས་དང་དབང་གིས་རྣམ་པར་རོལ་བ། མངོན་པར་ཤེས་པ་དང་། གཟུངས་དང་ལྡན་པ། སྤོབས་པ་ཡོངས་སུ་མི་ཟད་པ་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ། ཉོན་མོངས་པའི་བཤལ་ཐག་ཡོངས་སུ་གཅོད་པ། རིང་པོ་མི་ཐོགས་པར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་ལྡན་པར་འགྱུར་བ། བདུད་དང་། བདུད་ཀྱི་དམག་ཡོངས་སུ་འཇོམས་པ། ཆོས་ཀྱི་རྔ་རབ་ཏུ་སྒྲོགས་པ། མུ་སྟེགས་ཐམས་ཅད་ཡོངས་སུ་ཟློག་པས་བསམ་པ་རྣམ་པར་དག་པར་སྦྱོར་བ། དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ། ལྷ་དང་མི་ཐམས་ཅད་ཡོངས་སུ་སྒྲོལ་བ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ཡོངས་སུ་སྒྲུབ་པ། རྒྱུད་དྲུག་གི་སྐྱེ་བོ་ཡོངས་ལ་ཕན་འདོགས་པ། ཡེ་ཤེས་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ། བཟོད་པ་ཆེན་པོ་དང་ཡོངས་སུ་ལྡན་པ། བྱམས་པ་ཆེན་པོ་དང་།
en: A quintillion bodhisattvas mahāsattvas had also gathered there.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་སེམས་ལ་གནས་པ། གཞན་གྱིས་མི་ཐུབ་པའི་སྟོབས་ཆེན་པོ་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྒྱུ་ཞིང་མཆོད་པ་བྱེད་པ། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འཇུག་པ། མ་འོངས་པའི་བསྐལ་པའི་མཐར་ཡོངས་སུ་མི་ཟད་པའི་ཡི་དམ་གྱི་སྨོན་ལམ་ཆེན་པོ་བསྐྱེད་པ། སངས་རྒྱས་མང་པོ་ལས་ཤིན་དུ་ཟབ་མོའི་རྒྱུ་རྣམ་པར་དག་པ་བསྐྱེད་པ། དུས་གསུམ་གྱི་ཆོས་མ་སྐྱེས་པའི་བཟོད་པ་ཐོབ་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལས་ཡོངས་སུ་འདས་པ། འཇིག་རྟེན་གྱི་དོན་སྦྱོར་བ་ལ་མཁས་པ། སྟོན་པ་ཆེན་པོས་དགོངས་ཏེ་གསུངས་པའི་ཆོས་ཤིན་དུ་བཀོད་པ་རྒྱ་ཆེར་སྟོན་པ། སྟོང་པའི་མཚན་ཉིད་རྣམ་པར་དག་པའི་ཟབ་མོ་ལ་མཁས་པ། ཐེ་ཚོམ་ཡོངས་སུ་སྤངས་པ་ཤ་སྟག་སྟེ། དེ་དག་གི་མིང་ལ་འདི་ལྟ་སྟེ། བསྒྲིབས་པ་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་བར་སེམས་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། བརྩོན་འགྲུས་ཡོངས་སུ་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཡོངས་སུ་མི་སྐྱོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྱན་རས་གཟིགས་བྱང་ཆུབ་སེམས་དཔའ་དང་། གཟུངས་ཀྱི་དབང་པོའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤོབས་པ་ཆེན་པོའི་རྒྱན་གྱི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། རི་རབ་མཆོག་གི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། རྒྱ་མཚོ་ཆེན་པོ་ཟབ་མོའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་བྱང་ཆུབ་སེམས་དཔའ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སའི་སྙིང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། ནམ་མཁའི་སྙིང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། རིན་པོ་ཆེའི་ཕྱག་དབང་བྱང་ཆུབ་སེམས་དཔའ་དང་། རྡོ་རྗེའི་ཐལ་མོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། དགའ་བའི་སྟོབས་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཆོས་ཀྱི་སྟོབས་བྱང་ཆུབ་སེམས་དཔའ་དང་། འོད་རྒྱན་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། གསེར་གྱི་འོད་རྒྱན་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། རྟག་ཏུ་ཏིང་ངེ་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤེས་རབ་རྣམ་པར་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། བརྩོན་འགྲུས་དཀའ་ཐུབ་བྱང་ཆུབ་སེམས་དཔའ་དང་། བསམ་པ་ནམ་མཁའ་ཅི་བཞིན་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྨོན་ལམ་ཆེན་པོ་ཡོངས་སུ་མི་གཅོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྨན་གཏོང་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉོན་མོངས་པའི་ནད་རྣམ་པར་སེལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྨན་གྱི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། འཕགས་པར་དགའ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། གོང་དུ་ལུང་བསྟན་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་འོད་གཙང་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ཆོས་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་གྲགས་ཅན་དགའ་བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: They all had great, brilliant, powerful might, like the great king of the nāgas; had great fame; had nobility; had pure generosity and correct conduct; gave pure offerings and service; had for countless kalpas practiced patience, diligence, and meditation that transcended all; remained perfectly in mindfulness; had opened the door to wisdom; delighted in yoga, methods, and powers; possessed the higher cognitions and the power of mental retention; possessed unceasing eloquence; had eliminated all kleśas; had cut through the bondage of the kleśas; would soon possess omniscient wisdom; had defeated Māra and Māra’s armies; beat the drum of the Dharma; defeated all tīrthikas and brought them to correct thought; turned the wheel of the Dharma; liberated devas and humans; accomplished the adornment of the buddha realms in the ten directions; benefited beings in the six existences; always had a mind of great love and great compassion; had great invincible strength; went to all buddha realms and made offerings; did not pass into nirvāṇa; had made the great prayer of unceasing commitment until the end of all future kalpas; had developed pure, very profound causes in the presence of many buddhas; had attained quiescence with regard to the birthlessness of the phenomena of the three times; had transcended the field of activity of the śrāvakas and pratyekabuddhas; were skilled in engaging in benefiting the world; taught extensively the array of the Dharma taught with implied meanings by the great teachers; were skilled in the profound, pure characteristics of emptiness; and had completely eliminated doubts.

source: སྤྲིན་ཆེན་མཐའ་ཡས་གྲགས་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་སེང་གེ་སྒྲ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་གླེང་པོ་ཆེའི་རྒྱལ་པོའི་སྒྲ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་བཀྲ་ཤིས་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་རིན་ཆེན་ཡོན་ཏན་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ཉི་མའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ཟླ་བའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་སྐར་མའི་འོད་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་མེ་འོད་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་གློག་འོད་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་འབྲུག་སྒྲ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ཤེས་རབ་ཆར་ཡོངས་སུ་སྙོམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ཆར་གྱི་རྒྱལ་པོ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་མེ་ཏོག་སྡོང་པོའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་པདྨ་སྔོན་པོའི་བསུང་བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: Among them were those named the bodhisattva Anāvarana­dharma­cakra­pravarta, the bodhisattva Dharma­cakra­pravarta­cittotpāda, the bodhisattva Nityodyukta, the bodhisattva Aparikheda, the bodhisattva Maitreya, the bodhisattva Mañjuśrī, the bodhisattva Avalokiteśvara, the bodhisattva Dharaṇeśvararāja, the bodhisattva Mahā­pratibhāna­vyūharāja, the bodhisattva Sumeru­vara­parvata­rāja, the bodhisattva Mahā­gambhīra­sagara­rāja, the bodhisattva Ratnadhvaja, the bodhisattva Mahā­ratna­dhvaja, the bodhisattva Kṣitigarbha, the bodhisattva Ākāśagarbha, the bodhisattva Ratnapāṇeśvara, the bodhisattva Vajrapāṇi, the bodhisattva Ratibala, the bodhisattva Dharmabala, the bodhisattva Mahāprabhavyūha, the bodhisattva Mahā­suvarṇa­prabha­vyūha, the bodhisattva Viśuddhaśīla, the bodhisattva Sadāsamādhi, the bodhisattva Viśuddhaprajñā, the bodhisattva Viryatapas, the bodhisattva Ākāśavat, the bodhisattva Anikṣipta­mahā­praṇidhāna, the bodhisattva Bhaiṣajyadatta, the bodhisattva Kleśa­vyādhi­viṣkhambin, the bodhisattva Bhaiṣajyarāja, the bodhisattva Unnatananda, the bodhisattva Uttama­vyākaraṇa­prāpta, the bodhisattva Mahā­megha­viśuddha­prabha, the bodhisattva Mahā­megha­dharmapāla, the bodhisattva Mahā­megha­kīrtirati, the bodhisattva Mahā­meghānanta­kīrti, the bodhisattva Mahā­megha­siṃhanāda, the bodhisattva Mahā­megha­vṛṣabhaghoṣa, the bodhisattva Mahā­megha­maṅgala, the bodhisattva Mahā­megha­ratna­guṇa, the bodhisattva Mahā­megha­sūrya­garbha, the bodhisattva Mahā­megha­candra­garbha, the bodhisattva Mahā­megh­ajyoti­prabha, the bodhisattva Mahā­megha­jvala­prabha, the bodhisattva Mahā­megha­vidyut­prabha, the bodhisattva Mahāmeghasvara, the bodhisattva Mahā­megha­prajñā­samavarṣa, the bodhisattva Mahā­megha­viśuddhivarṣa­rāja, the bodhisattva Mahā­megha­puṣpa­druma­rāja, the bodhisattva Mahā­meghotpala­gandha, the bodhisattva Mahā­megha­ratna­candana­śitakāya, the bodhisattva Mahā­megha­tamoviṣkambhin, and the bodhisattva Mahā­megha­vitimira­viṣkambhin.

source: སྤྲིན་རིན་པོ་ཆེའི་ཙནྡན་སྐུ་རྣམ་པར་བསིལ་བ་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་མུན་པ་རྣམ་པར་སེལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། སྤྲིན་ཆེན་ལྟ་བའི་རབ་རིབ་རྣམ་པར་སེལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་དེ་དག་ཕྱི་དྲོའི་དུས་ན་སོ་སོའི་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས་གཡས་ཕྱོགས་ནས་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: That entourage of bodhisattvas mahāsattvas had in the afternoon arisen from their individual afternoon samādhis and come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: །གཞན་ཡང་འདི་ལྟ་སྟེ། ལིཙྪ་བཱི་གཞོན་ནུ་འབུམ་ཕྲག་འབུམ་བརྒྱད་སྟོང་ཡང་དེར་འདུས་པར་གྱུར་ཏེ། དེ་དག་གི་མིང་ལ་གཞོན་ནུ་སེང་གེའི་འོད་དང་། གཞོན་ནུ་སེང་གེའི་བློ་གྲོས་དང་། གཞོན་ནུ་ཆོས་བྱིན་དང་།
en: Also gathered there were eight hundred thousand times a hundred thousand Licchavī youths.

source: གཞོན་ནུ་དབང་པོ་སྦྱིན་དང་། གཞོན་ནུ་འོད་ཆེན་དང་། གཞོན་ནུ་དཔལ་ཆེན་དང་། གཞོན་ནུ་སངས་རྒྱས་སྐྱབས་དང་། གཞོན་ནུ་ཆོས་སྐྱབས་དང་། གཞོན་ནུ་དགེ་འདུན་སྐྱབས་དང་། གཞོན་ནུ་རྡོ་རྗེ་སྐྱབས་དང་། གཞོན་ནུ་ནམ་མཁའ་སྐྱབས་དང་།
en: Among them were those named Kumāra Siṃhaprabha, Kumāra Siṃhamati, Kumāra Dharmadatta, Kumāra Indradatta, Kumāra Mahāprabha, Kumāra Mahāśrī, Kumāra Buddhapāla, Kumāra Dharmapāla, Kumāra Saṅghapāla, Kumāra Vajrapāla, Kumāra Ākāśapāla, Kumāra Ākāśaghoṣa, Kumāra Ratnagarbha, and Kumāra Uttama­maṅgala­garbha.

source: གཞོན་ནུ་ནམ་མཁའ་སྒྲ་སྒྲོགས་དང་། གཞོན་ནུ་རིན་པོ་ཆེའི་སྙིང་པོ་དང་། གཞོན་ནུ་བཀྲ་ཤིས་མཆོག་གི་སྙིང་པོ་དང་། དེ་དག་གཞོན་ནུ་ཐམས་ཅད་ཀྱི་གཙོ་བོར་གྱུར་ནས། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་གནས་ཏེ་ཐེག་པ་ཆེན་པོའི་དད་པ་སོ་སོར་རྙེད་ནས།
en: They were supreme among all those youths residing in the highest enlightenment, each having found faith in the Mahāyāna.

source: ཕྱི་དྲོའི་དུས་ན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས། གཡས་ཕྱོགས་སུ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །གཞན་ཡང་འདི་ལྟ་སྟེ།
en: In the afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: ལྷའི་སྲས་པོ་བཞི་ཁྲི་ཉིས་སྟོང་ཡང་དེར་འདུས་པར་གྱུར་ཏེ། དེ་དག་གི་མིང་ལ་འདི་ལྟ་སྟེ། ལྷའི་སྲས་པོ་མཐོང་ན་དགའ་བ་དང་། ལྷའི་སྲས་པོ་ཡིད་དགའ་བ་དང་། ལྷའི་སྲས་པོ་ཉི་མའི་འོད་དང་།
en: Also gathered there were 42,000 devas.

source: ལྷའི་སྲས་པོ་ཟླ་བའི་གཙུག་ཏོར་དང་། ལྷའི་སྲས་པོ་ནམ་མཁའི་བློ་གྲོས་རྣམ་པར་དག་པ་དང་། ལྷའི་སྲས་པོ་ཉོན་མོངས་པ་ཡོངས་སུ་སྤངས་པ་དང་། ལྷའི་སྲས་པོ་རྣམ་པར་བཀྲ་ཤིས་དང་། དེ་དག་ཐམས་ཅད་ཀྱང་ལྷའི་སྲས་པོ་རྣམས་ཀྱི་གཙོ་བོར་གྱུར་པ།
en: The chief among these devas were named Deva Priyadarśana, Deva Pramudita, Deva Sūryaprabha, Deva Candraketu, Deva Ākāśaviśuddhiprajña, Deva Kleśaviṣkhambin, and Deva Maṅgala.

source: ཐེག་པ་ཆེན་པོའི་ཆོས་ཡོངས་སུ་སྐྱོང་བའི་ཡི་དམ་ཆེན་པོའི་སྨོན་ལམ་འདེབས་པ། དམ་པའི་ཆོས་ཡོངས་སུ་མི་ནུབ་པར་གདུང་འཚོབ་པ་དེ་དག་ཐམས་ཅད་ཕྱི་དྲོའི་དུས་ན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས་གཡས་ཕྱོགས་སུ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །གཞན་ཡང་འདི་ལྟ་སྟེ།
en: They had made the prayer of great commitment to protect the Mahāyāna Dharma, and all those lineage holders who prevented the Dharma from ceasing in the afternoon had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: ཀླུའི་རྒྱལ་པོ་ཉི་ཁྲི་བརྒྱད་སྟོང་ཡང་དེར་འདུས་པར་གྱུར་ཏེ། དེ་དག་གི་མིང་ལ་པདྨའི་ཀླུའི་རྒྱལ་པོ་དང་། ཨེ་ལའི་ལོ་མ་ཀླུའི་རྒྱལ་པོ་དང་། སྟོབས་པོ་ཆེ་ཀླུའི་རྒྱལ་པོ་དང་། སྒྲ་བོ་ཆེ་ཀླུའི་རྒྱལ་པོ་དང་།
en: Also gathered there were 28,000 nāga kings.

source: དབའ་རླབས་ཆུང་ངུའི་ཀླུའི་རྒྱལ་པོ་དང་། ཆུའི་རྒྱུ་འཛིན་ཀླུའི་རྒྱལ་པོ་དང་། གསེར་གྱི་བཞིན་ཀླུའི་རྒྱལ་པོ་དང་། ཡིད་བཞིན་ཀླུའི་རྒྱལ་པོ་དང་། དེ་དག་ཐམས་ཅད་ཀྱང་ཀླུའི་རྒྱལ་པོའི་གཙོ་བོར་གྱུར་པ།
en: The chief among these nāga kings were named Nāga King Padma, Nāga King Elapatra, Nāga King Mahābala, Nāga King Mahāghoṣa, Nāga King Alpormika, Nāga King Nadīdhara, Nāga King Suvarṇamukha, and Nāga King Manasvin.

source: ཐེག་པ་ཆེན་པོའི་ཆོས་ཡོངས་སུ་སྐྱོང་བར་ཡོངས་སུ་དགའ་བ་དང་། ཡོངས་སུ་འཛིན་པ་དང་། ལུང་ནོད་པ་དང་། ཤིན་ཏུ་ཟབ་མོའི་བསམ་པ་ལ་མོས་པ་དང་། རྗེས་སུ་ཡི་རངས་པ་དང་།
en: They delighted in protecting, holding, and receiving the Mahāyāna Dharma; they aspired to, rejoiced in, and protected and sustained very profound contemplation.

source: རྣམ་པར་སྐྱོང་ཞིང་འཚོ་བར་བྱེད་དེ། ཕྱི་དྲོའི་དུས་ན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས་གཡས་ཕྱོགས་ནས་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །གཞན་ཡང་འདི་ལྟ་སྟེ།
en: In the afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: གནོད་སྦྱིན་གྱི་འཁོར་སུམ་ཁྲི་དྲུག་སྟོང་ཡང་དེར་འདུས་པར་གྱུར་ཏོ། །དེ་དག་གི་གཙོ་བོ་ཐོག་མར་ལྷའི་རྒྱལ་པོ་མིག་མི་བཟང་གིས་དྲངས་ནས་ཨ་མྲའི་གནོད་སྦྱིན་དང་། ཨ་མྲ་ཐོགས་པའི་གནོད་སྦྱིན་དང་། པདྨ་འོད་ཀྱི་སྙིང་པོའི་གནོད་སྦྱིན་དང་། པདྨའི་བཞིན་གནོད་སྦྱིན་དང་།
en: Also gathered there were an entourage of 36,000 yakṣas.

source: ཁྲོ་གཉེར་གནོད་སྦྱིན་དང་། འཇིགས་པ་མངོན་དུ་སྟོན་པའི་གནོད་སྦྱིན་དང་། ས་ཀུན་གཡོ་བའི་གནོད་སྦྱིན་དང་། ཟས་ཀྱི་རིལ་མིང་གནོད་སྦྱིན་དང་། དེ་དག་ཐམས་ཅད་ཀྱང་གནོད་སྦྱིན་གྱི་གཙོ་བོར་གྱུར་པ་ཤ་སྟག་སྟེ།
en: The principal ones among them, led by King Virūpākṣa, were Yakṣa Amra, Yakṣa Amradhara, Yakṣa Padmaprabha, Yakṣa Padmamukha, Yakṣa Bhṛkuti, Yakṣa Mahābhīmadarśana, Yakṣa Bhūmikampa, and Yakṣa Annaharaṇa, all of whom were the chief among those yakṣas.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ལ་ཤིན་ཏུ་དད་པའི་སེམས་བསྐྱེད་པ། དམ་པའི་ཆོས་ཡོངས་སུ་སྐྱོང་ཞིང་སྲུང་བའི་སེམས་བསྐྱེད་པ་མི་སྐྱོ་བ།
en: They had developed a mind of faith in the Dharma of the Tathāgata; they had developed an unflagging motivation to protect and guard the Dharma.

source: ཕྱི་དྲོའི་དུས་ན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་པ་སྤྱི་བོས་ཕྱག་བྱས་ཏེ་གཡས་ཕྱོགས་ནས་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །གཞན་ཡང་འདི་ལྟ་སྟེ།
en: In the afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: ནམ་མཁའ་ལྡིང་གི་འཁོར་བཞི་ཁྲི་དགུ་སྟོང་ཡང་དེར་འདུས་པར་གྱུར་ཏེ། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེའི་བྱིན་གྱི་མཐུ་དང་ལྡན་པས་གཙོ་བོར་གྱུར་པ་དང་། གཞན་ཡང་འདི་ལྟ་སྟེ། དྲི་ཟའི་འཁོར་དང་། ལྷ་མ་ཡིན་གྱི་འཁོར་དང་། མིའམ་ཅིའི་འཁོར་དང་། གྲུལ་བུམ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་དང་། རི་དང་། ནགས་ཚལ་དང་། ཆུ་བོ་དང་། རྒྱ་མཚོ་རྣམས་ཀྱི་ལྷ་དང་། དྲང་སྲོང་དང་།
en: Also gathered there was an entourage of 49,000 garuḍas.

source: ཡུལ་ཁམས་ཆེན་པོ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་དང་། ཕོ་བྲང་འཁོར་དང་། བཙུན་མོ་དང་། སླས་དང་།
en: The principal one among them was the garuḍa king Gandhahastiprabhāvarāja.

source: དད་པ་རྣམ་པར་བསྐྱེད་པའི་བུ་ཕོ་དང་། བུ་མོ་དང་། ལྷ་དང་། མི་ལ་སོགས་པ་ཡོངས་སུ་འདུས་ཤིང་ལྷགས་ནས་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཐེག་པ་ཆེན་པོའི་ཆོས་འདི་ཡོངས་སུ་ཀློག་པ་དང་། འདོན་པ་དང་། འཆང་བ་དང་། འཛིན་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཀུན་དུ་སྤེལ་ཞིང་བསྐྱེད་པ་དང་།
en: There was also an entourage of gandharvas; an entourage of asuras; an entourage of kinnaras; an entourage of kumbhāṇḍas; an entourage of mahoragas; the devas of mountains, forests, rivers, and seas; ṛṣis and the kings of all great lands; the royal courts, queens, attendants, boys, girls, devas, and other people who had developed faith, and so on—all had gathered together and arrived there, and all had the commitment to read, recite, possess, keep, write out, and promulgate, maintain, and protect this unsurpassable Mahāyāna Dharma.

source: ཡོངས་སུ་འཚོ་བ་དང་། སྐྱོང་བའི་དམ་ཚིག་བཅས་ཏེ། ཕྱི་དྲོའི་དུས་ན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ལྷགས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་བྱས་ནས་གཡས་ཕྱོགས་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ལྟར་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ལྷ་དང་།
en: In the afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: མི་དང་། ཀླུ་དང་། གནོད་སྦྱིན་ལ་སོགས་པ་ཐམས་ཅད་འདུས་པར་གྱུར་ནས་སོ་སོ་ནས་བསྟི་སྟང་དང་། རིམ་གྲོའི་སེམས་བསྐྱེད་དེ། ཐལ་མོ་སྦྱར་ནས་རབ་ཏུ་འཛུམ་པའི་མིག་གིས་བཅོམ་ལྡན་འདས་ལ་བལྟ་ཞིང་ཅུང་ཟད་ཀྱང་མི་ཡེངས་པར་དམ་པའི་ཆོས་ཤིན་ཏུ་ཐོས་པར་སྨོན་ཏོ།
en: In that way, all those śrāvakas, bodhisattvas, devas, humans, nāgas, yakṣas, and so on had gathered, each having developed the motivation to venerate and serve; with palms together in homage and with unblinking eyes, they gazed without wavering upon the Bhagavat and aspired to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་ཏིང་ངེ་འཛིན་ལས་བཞེངས་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་ལ་གཟིགས་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །འཕགས་པ་གསེར་འོད་དམ་པའི་ཆོས། །མདོ་སྡེ་ཀུན་གྱི་རྒྱལ་པོ་འདི། །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་ཏེ། །ཤིན་ཏུ་མཉན་ཅིང་ཐོས་པར་དཀའ། །ངས་དེང་དཀྱིལ་འཁོར་ཁྱེད་རྣམས་ལ།
en: Then the Bhagavat, during that afternoon, arose from samādhi, looked upon the assembly of followers, and recited these verses: “The Sublime Golden Light, the noble Dharma That is the king of all the sūtras, The field of activity of all the buddhas, Is very difficult to hear and listen to. “

source: །དམ་པའི་མདོ་སྡེ་འདི་བསྟན་པས། །ཕྱོགས་བཞི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། །བྱིན་གྱི་རླབས་ཀྱིས་བརླབས་པར་འགྱུར། །ཤར་ཕྱོགས་སངས་རྒྱས་མི་འཁྲུགས་དང་། །ལྷོ་ཕྱོགས་སངས་རྒྱས་དཀོན་མཆོག་དཔལ། །ནུབ་ཕྱོགས་སངས་རྒྱས་སྣང་མཐའ་ཡས། །བྱང་ཕྱོགས་སངས་རྒྱས་རྔ་སྒྲ་སྐྱབས།
en: Through my teaching this sublime sūtra Today to you, this assembly, The buddhas in the four directions Will bestow their blessing: “The Buddha Akṣobhya in the east, The Buddha Ratnaketu in the south, The Buddha Amitābha in the west, And the Buddha Dundubhisvara in the north. “

source: །ངས་དེང་ཆོས་མཆོག་འདི་བསྟན་པས། །བཀྲ་ཤིས་འཆགས་པའི་དམ་པ་སྟེ། །སྡིག་པ་ཐམས་ཅད་གཞོམ་པའི་ཕྱིར། །སྡིག་པའི་ལས་ཀུན་ཟད་པར་འགྱུར།
en: Through teaching today this supreme Dharma All bad karma will come to an end, Because this sublime auspicious confession Overcomes all bad karma. “

source: །སྡུག་བསྔལ་ཐམས་ཅད་འཇོམས་པར་བྱེད། །བདེ་བ་ཐམས་ཅད་སྦྱིན་བྱེད་ཅིང་།
en: It will defeat all suffering; It will bestow every happiness.

source: །ཡེ་ཤེས་རྩ་བ་ཀུན་མཁྱེན་དང་། །དཔལ་ཀུན་གྱིས་ཀྱང་བརྒྱན་པར་འགྱུར། །སེམས་ཅན་གང་དག་དབང་པོ་ཉམས། །དཔལ་མེད་པས་ནི་གང་ཟིན་ཅིང་། །ལྷ་རྣམས་ཀྱང་ནི་འཕང་བར་འགྱུར། །གཉེན་སྡུག་ཀུན་ཀྱང་སྡང་བ་དང་། །བུ་སྨད་འཁོར་དང་བྲལ་བ་དང་། །ཕན་ཚུན་དུ་ནི་མི་འཕྲོད་ཅིང་། །ནོར་སྟོར་བས་ནི་རབ་གཙེས་ཏེ།
en: It is adorned by the root of wisdom, By omniscience, and by every splendor. “

source: །གཟའ་དང་སྐར་མས་གནོད་བྱས་ཤིང་། །བྱད་སྟེམས་མི་བཟད་ཟིན་པ་དང་། །མྱ་ངན་ཉོན་མོངས་ལས་རྣམས་ཀྱིས། །ཤིན་ཏུ་མི་བཟད་གཟིར་བ་དང་། །རྨི་ལམ་ལྟས་སྡིག་མཐོང་བ་ལས། །མྱ་ངན་རབ་ཏུ་འཁྲུག་པ་རྣམས། །གཙང་མར་ལུས་ཀྱིས་ཁྲུས་གྱིས་ལ། །གོས་གཙང་སར་པ་དེ་བགོས་ནས།
en: Those beings who have impaired faculties, Who have been seized by misfortune, Who have been forsaken by the devas, “Who are hated by family and friends, Who are separated from family and companions, Who are in conflict with others, Who are harmed by loss of wealth, “Who are harmed by the planets and constellations, Who are attacked by dreadful sorcery, Who are oppressed by extremely dreadful Misery, kleśas, and karma, “Who see bad omens in their dreams, And are extremely disturbed by misery Should wash their bodies clean And wear new, clean clothes. “

source: །མདོ་སྡེ་དམ་པའི་རྒྱལ་པོ་འདི། །སངས་རྒྱས་ཟབ་མོའི་སྤྱོད་ཡུལ་ཏེ། །ཀློག་འདོན་རབ་ཏུ་འཛིན་པ་ལ། །གུས་པའི་སེམས་ཀྱིས་ཉོན་ཅིག་དང་།
en: This king of sublime sūtras Is the profound field of the buddhas, And they should listen with a mind of veneration To the one who reads, recites, and possesses it. “

source: །མདོ་སྡེ་འདི་ཡི་བྱིན་བརླབས་ཀྱིས། །རྨི་ངན་ལྟས་སྡིག་འཇོམས་པ་དང་།
en: Then, through the blessing of the sūtra, All bad dreams and bad omens will be defeated.

source: །སྡུག་བསྔལ་ཐམས་ཅད་བཟློག་པས་ནི། །ཡོངས་སུ་མ་ལུས་ཟད་པར་འགྱུར།
en: All suffering will be repelled And come to a complete end. “

source: །འཇིག་རྟེན་སྐྱོང་བའི་རྒྱལ་པོ་བཞི། །བློན་པོ་དང་ནི་འཁོར་བཅས་དང་། །གནོད་སྦྱིན་བྱེ་བ་མང་པོ་རྣམས། །ཤིན་ཏུ་གུས་པས་རིམ་གྲོ་བསྐྱེད། །སྤོབས་པའི་ལྷ་མོ་ཆེན་མོ་དང་།
en: The Four Mahārājas who guard the world, And their ministers and courts And many millions of yakṣas, Will respectfully come to their aid. “

source: །ནཻ་ར་ཉྫ་ན་ར་གནས་པའི་ལྷ། །དེ་བཞིན་འཕྲོག་མ་འབྱུང་པོའི་མ། །སྲ་བ་ས་ཡི་ལྷ་མོ་དང་། །ཚངས་པའི་དབང་པོ་བརྒྱ་བྱིན་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་མིའམ་ཅི། །ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དང་། །ལྷ་མ་ཡིན་གྱི་འཁོར་རྣམས་བཅས། །དེ་ལྟར་མཐུ་ཆེན་དེ་དག་ཀུན། །རང་གི་འཁོར་རྣམས་ཁྲིད་ནས་ནི། །ཉིན་མཚན་རྟག་ཏུ་མི་འབྲལ་བར།
en: The great goddess Sarasvatī And Nairañjana­vasinī, Hārītī, the mother of spirits, And Dṛḍhā, the goddess of the earth; “The lords of Brahmās, Śakra, The nāga kings, the kinnaras, And the kings of the garuḍas, Together with an entourage of asuras— “All of those who have great power, Leading all their entourages, Will be always present, day and night, Guarding that individual. “
